app/controllers/tasks_controller.rb

  def create
    @task = Task.create(task_params)
---
INSERT INTO "tasks" ("created_at", "deadline", "description", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-11-26 20:47:31.415773"], ["deadline", "2016-11-26 20:47:00.000000"], ["description", "Hey"], ["updated_at", "2016-11-26 20:47:31.415773"]]

  def update
    @task.update_attributes(task_params)
---
UPDATE "tasks" SET "deadline" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["deadline", "2016-11-26 20:25:00.000000"], ["updated_at", "2016-11-26 20:25:28.047646"]]

    def set_tasks
      @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]